modm-ext/data.modm.io/docs/svd/header_stm32u5a5xx.svd
        <register>
          <name>DFLTISR1</name>
          <description>MDF DFLT Interrupt status Register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FTHF</name>
              <description>RXFIFO threshold interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DOVRF</name>
              <description>Data overflow interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSDRF</name>
              <description>Snapshot data ready interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXNEF</name>
              <description>Snapshot data ready interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OLDF</name>
              <description>OLD interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THLF</name>
              <description>OLD interrupt flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THHF</name>
              <description>OLD interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SSOVRF</name>
              <description>Snapshot overrun interrupt flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCDF</name>
              <description>Short circuit dtector interrupt flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SATF</name>
              <description>Saturation detection interrupt flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABF</name>
              <description>Clock absence detection interrupt flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFOVRF</name>
              <description>reshape filter overrun interrupt flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDDETF</name>
              <description>SAD interrupt flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDLVLF</name>
              <description>Sound level value ready interrupt flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OECCR1</name>
          <description>MDF</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OFFSET</name>
              <description>Short circuit detector enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SADCR1</name>
          <description>MDF SAD Control Register</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SADEN</name>
              <description>SAD enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATCAP</name>
              <description>SAD data capture mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DETCFG</name>
              <description>SAD trigger event configuration</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SADST</name>
              <description>SAD state</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HYSTEN</name>
              <description>Hysteresis enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRSIZE</name>
              <description>Frame size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SADMOD</name>
              <description>SAD working mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SADACTIVE</name>
              <description>SAD active flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SADCFGR1</name>
          <description>MDF SAD configuration register</description>
          <addressOffset>0x13c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SNTHR</name>
              <description>Signal to noise threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ANSLP</name>
              <description>Ambiant noise slope control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LFRNB</name>
              <description>Number of learning frames</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>HGOVR</name>
              <description>Hangover time window</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ANMIN</name>
              <description>Hangover time window</description>
              <bitOffset>16</bitOffset>
              <bitWidth>13</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SADSDLVR1</name>
          <description>MDF SAD Sound level Register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SDLVL</name>
              <description>Short term sound level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SADANLVR1</name>
          <description>MDF SAD Ambient Noise level Register</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ANLVL</name>
              <description>Ambiant noise level estimation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SNPSDR1</name>
          <description>MDF Snapshot Data Register</description>
          <addressOffset>0x16c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MCICDC</name>
              <description>MCIC decimation counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>EXTSDR</name>
              <description>Extended data size</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SDR</name>
              <description>Extended data size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLTDR1</name>
          <description>MDF Digital Filter Data Register</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DR</name>
              <description>MCIC decimation counter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SITFCR2</name>
          <description>MDF Serial Interface Control Register</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SITFEN</name>
              <description>Serial interface enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCKSRC</name>
              <description>Serial clock source</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SITFMOD</name>
              <description>Serial interface type</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>STH</name>
              <description>Manchester Symbol threshold / SPI threshold</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SITFACTIVE</name>
              <description>Serial interface active flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BSMXCR2</name>
          <description>MDF Bitstream Matrix Control Register</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BSSEL</name>
              <description>Bit Streal selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>BSMXACTIVATE</name>
              <description>Bit Streal activation flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLTCR2</name>
          <description>MDF Digital Filter Control Register</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DFLTEN</name>
              <description>Digital filter enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA request enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FTH</name>
              <description>RXFIFO Threshold selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACQMOD</name>
              <description>Digital filter trigger mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>TRGSENS</name>
              <description>Digital filter trigger sensitivity selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRGSRC</name>
              <description>Digital filter trigger signal selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SNPSFMT</name>
              <description>SnapShot Data format</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBDIS</name>
              <description>Number of samples to be discard</description>
              <bitOffset>20</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DFLTRUN</name>
              <description>Digital filter run status flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFLTACTIVE</name>
              <description>Digital filter active flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLTCICR2</name>
          <description>MDF MCIC Configuration Register</description>
          <addressOffset>0x18c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATSRC</name>
              <description>Source Data for the digital filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CICMOD</name>
              <description>Select the CIC Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MCICD</name>
              <description>CIC decimation ratio selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
            <field>
              <name>SCALE</name>
              <description>Scaling factor selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLTRSFR2</name>
          <description>MDF Reshape Filter Configuration Register</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RSFLTBYP</name>
              <description>Reshape filter bypass</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSFLTD</name>
              <description>Reshape filter decimation ratio</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPFBYP</name>
              <description>High-pass filter bypass</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPFC</name>
              <description>High-pass filter cut-off frequency</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DFLTINTR2</name>
          <description>MDF Integrator Configuration Register</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INTDIV</name>
              <description>Integrator output dividion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>INTVAL</name>
              <description>Integrator value selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OLDCR2</name>
          <description>MDF Out-Of Limit Detector Control Register</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OLDEN</name>
              <description>OLD enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>THINB</name>
              <description>OLD threshold in band</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKOLD</name>
              <description>Bteak signal assignment for OLD</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ACICN</name>
              <description>OLD CIC order selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ACICD</name>
              <description>OLD CIC decimation ratio selection</description>
              <bitOffset>17</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OLDACTIVE</name>
              <description>OLD active flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OLDTHLR2</name>
          <description>MDF OLD Threshold Low Register</description>
          <addressOffset>0x19c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OLDTHL</name>
              <description>OLD Low threshold value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OLDTHHR2</name>
          <description>MDF OLD Threshold High Register</description>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OLDTHH</name>
              <description>OLD High threshold value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DLYCR2</name>
          <description>MDF Delay control Register</description>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SKPDLY</name>
              <description>Delay to apply to a bitstream</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>SKPBF</name>
              <description>DSkip Busy Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCDCR2</name>
          <description>MDF short circuit detector control Register</description>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCDEN</name>
              <description>Short circuit detector enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKSCD</name>
              <description>Break signal assignment to short circuit detector</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SCDT</name>
              <description>Short circuit detector threshold</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>SCDACTIVE</name>
              <description>Short circuit detector active flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
