modm-ext/data.modm.io/docs/svd/header_stm32u5a5xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GTZC_MPCBB1</name>
      <groupName>GTZC_MPCBB</groupName>
      <baseAddress>0x40032c00</baseAddress>
      <registers>
        <register>
          <name>CR</name>
          <description>MPCBBx control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GLOCK</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INVSECSTATE</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRWILADIS</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGLOCKR1</name>
          <description>MPCBBx Configuration lock register 1</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPLCK0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK1</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK2</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK3</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK4</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK5</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK6</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK7</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK8</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK9</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK10</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK11</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK12</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK13</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK14</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK15</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK16</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK17</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK18</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK19</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK20</name>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK21</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK22</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK23</name>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK24</name>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK25</name>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK26</name>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK27</name>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK28</name>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK29</name>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK30</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK31</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGLOCKR2</name>
          <description>MPCBBx Configuration lock register 2</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SPLCK32</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK33</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK34</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK35</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK36</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK37</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK38</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK39</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK40</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK41</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK42</name>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK43</name>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK44</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK45</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK46</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK47</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK48</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK49</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK50</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SPLCK51</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECCFGR0</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR1</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR2</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR3</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR4</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR5</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR6</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR7</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR8</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR9</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR10</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR11</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR12</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR13</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR14</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR15</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x13c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR16</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR17</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR18</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR19</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x14c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR20</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR21</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR22</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR23</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x15c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR24</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR25</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR26</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR27</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x16c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR28</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR29</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR30</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR31</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x17c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR32</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR33</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR34</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR35</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x18c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR36</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR37</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR38</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR39</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x19c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR40</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR41</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR42</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR43</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR44</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x1b0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR45</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR46</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x1b8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR47</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR48</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR49</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR50</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x1c8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECCFGR51</name>
          <description>MPCBBx security configuration registers</description>
          <addressOffset>0x1cc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR0</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR1</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVCFGR2</name>
          <description>MPCBBx privilege configuration registers</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
