modm-ext/data.modm.io/docs/svd/header_stm32u5a5xx.svd
        <register>
          <name>DIEPDMA7</name>
          <description>IN Endpoint DMA Address Register</description>
          <addressOffset>0x9f4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>DMA address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTXFSTS7</name>
          <description>IN Endpoint Tx FIFO Status Register</description>
          <addressOffset>0x9f8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space avail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPCTL8</name>
          <description>dev IN Endpoint Control Register</description>
          <addressOffset>0xa00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>Maximum packet size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>USBAEP</name>
              <description>USB active endpoint</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EONUM_DPID</name>
              <description>Even/odd frame</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAK status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPTYP</name>
              <description>Endpoint type</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL handshake</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>TxFIFO number</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CNAK</name>
              <description>Clear NAK</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SNAK</name>
              <description>Set NAK</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SD0PID_SEVNFRM</name>
              <description>Set DATA0 PID/Set even frame</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SD1PID_SODDFRM</name>
              <description>Set DATA1 PID/Set odd frame</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPDIS</name>
              <description>Endpoint disable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPENA</name>
              <description>Endpoint enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT8</name>
          <description>dev IN Endpoint Itr Register</description>
          <addressOffset>0xa08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XFRC</name>
              <description>Transfer completed interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPDISD</name>
              <description>Endpoint disabled interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOC</name>
              <description>Timeout condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITTXFE</name>
              <description>IN token received when TxFIFO is empty</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INEPNM</name>
              <description>IN token received with EP mismatch</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INEPNE</name>
              <description>IN endpoint NAK effective</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFE</name>
              <description>Transmit FIFO empty</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFIFOUDRN</name>
              <description>Transmit Fifo Underrun</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BNA</name>
              <description>Buffer not available interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKTDRPSTS</name>
              <description>Packet dropped status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BERR</name>
              <description>Babble error interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAK</name>
              <description>NAK interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTSIZ8</name>
          <description>IN Endpoint Txfer Size Register</description>
          <addressOffset>0xa10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>MCNT</name>
              <description>Multi count</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPDMA8</name>
          <description>IN Endpoint DMA Address Register</description>
          <addressOffset>0xa14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>DMA address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTXFSTS8</name>
          <description>IN Endpoint Tx FIFO Status Register</description>
          <addressOffset>0xa18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space avail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPCTL9</name>
          <description>dev IN Endpoint Control Register</description>
          <addressOffset>0xa20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>Maximum packet size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>USBAEP</name>
              <description>USB active endpoint</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EONUM_DPID</name>
              <description>Even/odd frame</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAK status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPTYP</name>
              <description>Endpoint type</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL handshake</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>TxFIFO number</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CNAK</name>
              <description>Clear NAK</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SNAK</name>
              <description>Set NAK</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SD0PID_SEVNFRM</name>
              <description>Set DATA0 PID/Set even frame</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SD1PID_SODDFRM</name>
              <description>Set DATA1 PID/Set odd frame</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPDIS</name>
              <description>Endpoint disable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPENA</name>
              <description>Endpoint enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT9</name>
          <description>dev IN Endpoint Itr Register</description>
          <addressOffset>0xa28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XFRC</name>
              <description>Transfer completed interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPDISD</name>
              <description>Endpoint disabled interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOC</name>
              <description>Timeout condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITTXFE</name>
              <description>IN token received when TxFIFO is empty</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INEPNM</name>
              <description>IN token received with EP mismatch</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INEPNE</name>
              <description>IN endpoint NAK effective</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFE</name>
              <description>Transmit FIFO empty</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFIFOUDRN</name>
              <description>Transmit Fifo Underrun</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BNA</name>
              <description>Buffer not available interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKTDRPSTS</name>
              <description>Packet dropped status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BERR</name>
              <description>Babble error interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAK</name>
              <description>NAK interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTSIZ9</name>
          <description>IN Endpoint Txfer Size Register</description>
          <addressOffset>0xa30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>MCNT</name>
              <description>Multi count</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPDMA9</name>
          <description>IN Endpoint DMA Address Register</description>
          <addressOffset>0xa34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>DMA address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DTXFSTS9</name>
          <description>IN Endpoint Tx FIFO Status Register</description>
          <addressOffset>0xa38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INEPTFSAV</name>
              <description>IN endpoint TxFIFO space avail</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPCTL10</name>
          <description>dev IN Endpoint Control Register</description>
          <addressOffset>0xa40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MPSIZ</name>
              <description>Maximum packet size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>USBAEP</name>
              <description>USB active endpoint</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EONUM_DPID</name>
              <description>Even/odd frame</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAK status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPTYP</name>
              <description>Endpoint type</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL handshake</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>TxFIFO number</description>
              <bitOffset>22</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CNAK</name>
              <description>Clear NAK</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SNAK</name>
              <description>Set NAK</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SD0PID_SEVNFRM</name>
              <description>Set DATA0 PID/Set even frame</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SD1PID_SODDFRM</name>
              <description>Set DATA1 PID/Set odd frame</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPDIS</name>
              <description>Endpoint disable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPENA</name>
              <description>Endpoint enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPINT10</name>
          <description>dev IN Endpoint Itr Register</description>
          <addressOffset>0xa48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XFRC</name>
              <description>Transfer completed interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EPDISD</name>
              <description>Endpoint disabled interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TOC</name>
              <description>Timeout condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITTXFE</name>
              <description>IN token received when TxFIFO is empty</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INEPNM</name>
              <description>IN token received with EP mismatch</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INEPNE</name>
              <description>IN endpoint NAK effective</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFE</name>
              <description>Transmit FIFO empty</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXFIFOUDRN</name>
              <description>Transmit Fifo Underrun</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BNA</name>
              <description>Buffer not available interrupt</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKTDRPSTS</name>
              <description>Packet dropped status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BERR</name>
              <description>Babble error interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NAK</name>
              <description>NAK interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPTSIZ10</name>
          <description>IN Endpoint Txfer Size Register</description>
          <addressOffset>0xa50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>XFRSIZ</name>
              <description>Transfer size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet count</description>
              <bitOffset>19</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>MCNT</name>
              <description>Multi count</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
