modm-ext/data.modm.io/docs/svd/header_stm32u5a5xx.svd
    <peripheral derivedFrom="SDMMC1">
      <name>SDMMC1_S</name>
      <description>Secure digital input/output Interface</description>
      <groupName>SDMMC</groupName>
      <baseAddress>0x520c8000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_SDMMC1_S</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x520c8400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_SDMMC2_S</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x520c8800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SDMMC1">
      <name>SDMMC2_S</name>
      <description>Secure digital input/output Interface</description>
      <groupName>SDMMC</groupName>
      <baseAddress>0x520c8c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_OCTOSPI1_S</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x520cf000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_OCTOSPI2_S</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x520cf400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank1_R">
      <name>FMC_Bank1_R_S</name>
      <description>Flexible Memory Controller</description>
      <groupName>FMC_Bank1</groupName>
      <baseAddress>0x520d0400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank3_R">
      <name>FMC_Bank3_R_S</name>
      <description>Flexible Memory Controller Bank3</description>
      <groupName>FMC_Bank3</groupName>
      <baseAddress>0x520d0480</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank1E_R">
      <name>FMC_Bank1E_R_S</name>
      <description>Flexible Memory Controller Bank1E</description>
      <groupName>FMC_Bank1E</groupName>
      <baseAddress>0x520d0504</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OCTOSPI1">
      <name>OCTOSPI1_S</name>
      <description>HEXA and OCTO Serial Peripheral Interface</description>
      <groupName>XSPI</groupName>
      <baseAddress>0x520d1400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OCTOSPI1">
      <name>OCTOSPI2_S</name>
      <description>HEXA and OCTO Serial Peripheral Interface</description>
      <groupName>XSPI</groupName>
      <baseAddress>0x520d2400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="HSPI1">
      <name>HSPI1_S</name>
      <description>HEXA and OCTO Serial Peripheral Interface</description>
      <groupName>XSPI</groupName>
      <baseAddress>0x520d3400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SYSCFG">
      <name>SYSCFG_S</name>
      <description>System configuration controller</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x56000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI3_S</name>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x56002000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPUART1">
      <name>LPUART1_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x56002400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C3_S</name>
      <description>Inter-integrated Circuit Interface</description>
      <groupName>I2C</groupName>
      <baseAddress>0x56002800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM1_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x56004400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM3_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x56004800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM4_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x56004c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OPAMP12_COMMON">
      <name>OPAMP12_COMMON_S</name>
      <groupName>OPAMP_Common</groupName>
      <baseAddress>0x56005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OPAMP1">
      <name>OPAMP1_S</name>
      <description>Operational Amplifier (OPAMP)</description>
      <groupName>OPAMP</groupName>
      <alternatePeripheral>OPAMP12_COMMON_S</alternatePeripheral>
      <baseAddress>0x56005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OPAMP1">
      <name>OPAMP_S</name>
      <description>Operational Amplifier (OPAMP)</description>
      <groupName>OPAMP</groupName>
      <alternatePeripheral>OPAMP12_COMMON_S</alternatePeripheral>
      <baseAddress>0x56005000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OPAMP1">
      <name>OPAMP2_S</name>
      <description>Operational Amplifier (OPAMP)</description>
      <groupName>OPAMP</groupName>
      <baseAddress>0x56005010</baseAddress>
    </peripheral>
    <peripheral derivedFrom="COMP12">
      <name>COMP12_S</name>
      <description>Comparator</description>
      <groupName>COMP</groupName>
      <baseAddress>0x56005400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP1_S</name>
      <description>Comparator</description>
      <groupName>COMP</groupName>
      <alternatePeripheral>COMP12_S</alternatePeripheral>
      <baseAddress>0x56005400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP2_S</name>
      <description>Comparator</description>
      <groupName>COMP</groupName>
      <baseAddress>0x56005404</baseAddress>
    </peripheral>
    <peripheral derivedFrom="VREFBUF">
      <name>VREFBUF_S</name>
      <description>VREFBUF</description>
      <groupName>VREFBUF</groupName>
      <baseAddress>0x56007400</baseAddress>
    </peripheral>
